#### SetSelection Method

---

|  |
| --- |
| FabricationNetworkChangeService Class   See Also |

Set the element selection to change the service or size for.

**Namespace:**   Autodesk.Revit.DB.Fabrication
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2018.2

# Syntax

| C# |
| --- |
| ``` public FabricationNetworkChangeServiceResult SetSelection( 	ISet<ElementId> selection ) ``` |

| Visual Basic |
| --- |
| ``` Public Function SetSelection ( _ 	selection As ISet(Of ElementId) _ ) As FabricationNetworkChangeServiceResult ``` |

| Visual C++ |
| --- |
| ``` public: FabricationNetworkChangeServiceResult SetSelection( 	ISet<ElementId^>^ selection ) ``` |

#### Parameters

selection
:   Type:  System.Collections.Generic ISet   ElementId
     The set of element identifiers of fabrication parts to change the service or size for.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

FabricationNetworkChangeService Class

Autodesk.Revit.DB.Fabrication Namespace